Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport
The Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport class provides the methods for invoking native code in TS Core through DllImport.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.customPartName
The name of the custom part.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.objectId
The ID of the model object lying under the picked point(s) or the pour break being modified.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.GetCustomPartExtrema(System.Int32,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.GetCustomPartExtrema(System.String,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.GetCustomPartEdges(System.String,Tekla.Structures.ModelInternal.dotEdges_t@)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.SetConnectedFaces(System.Int32,Tekla.Structures.DirectManipulation.Model.Native.dotDMObjectFaces_t)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.GetConnectedFaces(System.Int32,Tekla.Structures.DirectManipulation.Model.Native.dotDMObjectFaces_t@)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.GetDmPlugin(Tekla.Structures.DirectManipulation.Adapter.State.Native.dotComponentData@)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.GetPreviewSinglePolygonPolymesh(System.Int32,Tekla.Structures.DirectManipulation.Model.Native.dotDMPreviewPolygonFaceInput_t@,Tekla.Structures.ModelInternal.dotPolymesh_t@)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.GetActualSinglePolygonPolymesh(System.Int32,Tekla.Structures.DirectManipulation.Model.Native.dotDMPreviewPolygonFaceInput_t@,Tekla.Structures.ModelInternal.dotPolymesh_t@)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.GetPreviewPolylinePolymeshForCreation(System.Int32,Tekla.Structures.DirectManipulation.Model.Native.dotDMPreviewPolygonalPourBreakInput_t@,Tekla.Structures.ModelInternal.dotPolymesh_t@)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.GetActualPolylinePolymeshForCreation(System.Int32,Tekla.Structures.ModelInternal.dotPolymesh_t@)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.GetPreviewPolylinePolymeshesForSplitting(System.Int32,Tekla.Structures.DirectManipulation.Model.Native.dotDMPreviewPolygonalPourBreakInput_t@,Tekla.Structures.ModelInternal.dotPolymesh_t@)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.GetActualPolylinePolymeshesForSplitting(System.Int32,Tekla.Structures.ModelInternal.dotPolymesh_t@)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.GetPreviewPolylinePolymeshForModification(System.Int32,Tekla.Structures.DirectManipulation.Model.Native.dotDMPreviewPolygonalPourBreakInput_t@,Tekla.Structures.ModelInternal.dotPolymesh_t@)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.GetActualPolylinePolymeshForModification(System.Int32,Tekla.Structures.ModelInternal.dotPolymesh_t@)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.ExportIntListHandler(Tekla.Structures.ModelInternal.dotnetIntList_t@)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.ImportIntListHandler(Tekla.Structures.ModelInternal.dotnetIntList_t@)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.ExportDoubleListHandler(Tekla.Structures.ModelInternal.dotnetDoubleList_t@)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.ImportDoubleListHandler(Tekla.Structures.ModelInternal.dotnetDoubleList_t@)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.ExportPointListHandler(Tekla.Structures.ModelInternal.dotnetPointList_t@)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.ImportPointListHandler(Tekla.Structures.ModelInternal.dotnetPointList_t@)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.RebarGuidelineCalculateSpacingActuals(Tekla.Structures.ModelInternal.dotRebarSpacing_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingZone_t}@,System.Double)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.RebarGuidelineGetActualCurve(System.Int32,System.Int32,System.Collections.Generic.List{Tekla.Structures.DirectManipulation.Adapter.Native.dotBool}@,System.Collections.Generic.List{Tekla.Structures.Internal.dotPoint_t}@,Tekla.Structures.DirectManipulation.Adapter.Native.dotBool@)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.RebarStripGetActualCurve(System.Int32,System.Collections.Generic.List{Tekla.Structures.DirectManipulation.Adapter.Native.dotBool}@,System.Collections.Generic.List{Tekla.Structures.Internal.dotPoint_t}@,Tekla.Structures.DirectManipulation.Adapter.Native.dotBool@)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.RebarSetGetBarSurface(System.Int32,System.Int32,Tekla.Structures.DirectManipulation.Model.Native.dotBarSurface_t@)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.RebarSetGetAppliedAttributes(Tekla.Structures.ModelInternal.dotRebarSet_t@,Tekla.Structures.ModelInternal.dotGuideline_t@,Tekla.Structures.ModelInternal.dotLegFace_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingZone_t})


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.PropertyStripGetAppliedAttributes(Tekla.Structures.ModelInternal.dotRebarPropertyStrip_t@)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.EndDetailStripGetAppliedAttributes(Tekla.Structures.ModelInternal.dotRebarEndDetailStrip_t@)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.SplitterStripGetAppliedAttributes(Tekla.Structures.ModelInternal.dotRebarSplitter_t@)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.RebarSetSetAppliedAttributes(Tekla.Structures.ModelInternal.dotRebarSet_t@,Tekla.Structures.ModelInternal.dotGuideline_t@,Tekla.Structures.ModelInternal.dotLegFace_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingZone_t})


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.PropertyStripSetAppliedAttributes(Tekla.Structures.ModelInternal.dotRebarPropertyStrip_t@)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.EndDetailStripSetAppliedAttributes(Tekla.Structures.ModelInternal.dotRebarEndDetailStrip_t@)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.SplitterStripSetAppliedAttributes(Tekla.Structures.ModelInternal.dotRebarSplitter_t@)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.RebarSetLoadDialogAttributes(System.String,Tekla.Structures.ModelInternal.dotRebarSet_t@,Tekla.Structures.ModelInternal.dotGuideline_t@,Tekla.Structures.ModelInternal.dotLegFace_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingZone_t})


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.PropertyStripLoadDialogAttributes(System.String,Tekla.Structures.ModelInternal.dotRebarPropertyStrip_t@)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.EndDetailStripLoadDialogAttributes(System.String,Tekla.Structures.ModelInternal.dotRebarEndDetailStrip_t@)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.SplitterStripLoadDialogAttributes(System.String,Tekla.Structures.ModelInternal.dotRebarSplitter_t@)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.RebarSetSaveDialogAttributes(System.String,Tekla.Structures.ModelInternal.dotRebarSet_t@,Tekla.Structures.ModelInternal.dotGuideline_t@,Tekla.Structures.ModelInternal.dotLegFace_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingZone_t})


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.PropertyStripSaveDialogAttributes(System.String,Tekla.Structures.ModelInternal.dotRebarPropertyStrip_t@)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.EndDetailStripSaveDialogAttributes(System.String,Tekla.Structures.ModelInternal.dotRebarEndDetailStrip_t@)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.SplitterStripSaveDialogAttributes(System.String,Tekla.Structures.ModelInternal.dotRebarSplitter_t@)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.RebarSetDisplayUDAsDialog(System.Int32,System.Int32)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.RebarSetGetAppliedUDAs(Tekla.Structures.ModelInternal.dotGetProperties_t@,System.Int32)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.RebarSetAutomaticGuidelineOffsets(System.Int32,System.Int32,System.Double@,System.Double@)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.CheckForAndHandleNewCreatedDuplicates(System.Int32)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.ChangeLegFaceLayer(System.Int32,System.Collections.Generic.List{System.Int32},System.Int32)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.CreateRebarSetSurfaceObjectRelation(System.Int32,System.Int32)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.SelectInViews(Tekla.Structures.ModelInternal.dotUIModelObjectSelector_t@,Tekla.Structures.DirectManipulation.Adapter.Native.dotBool)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.GetSurfacePreviewForCreation(System.Int32,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.ModelInternal.dotPolymesh_t@)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.ExtendWorkAreaOrViewDepth(System.Collections.Generic.IEnumerable{System.Int32})


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.FitWorkArea(System.Int32,System.Int32)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.CheckAutoSaveState


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.CleanShapeFromSolidCache(System.String)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.CreateDmHandle(Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotBitmapHandle_t@)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.CreateDmBitmap(System.Int32,Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotBitmap_t@)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.SetDmHandleLocation(Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotBitmapHandle_t@)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DeleteDmHandle(Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotBitmapHandle_t@)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DmGetTemporaryGraphicsId(System.Int32@)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DmRemoveTemporaryGraphics(System.Int32,System.Int32)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DmDrawTemporaryLines(Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotTemporaryDrawPolyLine_t@)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DmDrawTemporaryPolyLine(Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotTemporaryDrawPolyLine_t@)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DmDrawTemporaryPolygonFace(Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotTemporaryDrawPolygonFace_t@)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.SetUpdateRebarSetAppliedUdaCallback(Tekla.Structures.DirectManipulation.Model.UpdateRebarSetAppliedUDAsDelegate)


Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.dotExportGetPartExtrema(System.Int32,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@)
Gets the extrema of the object.
id: The object id.
minPoint: The minimum point of the extrema.
maxPoint: The maximum point of the extrema.
Returns: True if the extrema was successfully retrieved, otherwise false.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportGetCustomPartExtremaById(System.Int32,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@)
Gets the extrema of the custom part. These are in the custom parts own coordinate system,
since the extrema of the custom part type would be meaningless in locals.
id: The ID of the custom part type.
minPoint: The minimum point of the extrema.
maxPoint: The maximum point of the extrema.
Returns: True if the extrema was successfully retrieved, otherwise false.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportGetCustomPartExtrema(System.String,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@)
Gets the extrema of the custom part. These are in the custom parts own coordinate system,
since the extrema of the custom part type would be meaningless in locals.
name: The name of the custom part type.
minPoint: The minimum point of the extrema.
maxPoint: The maximum point of the extrema.
Returns: True if the extrema was successfully retrieved, otherwise false.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportGetCustomPartEdges(System.String,Tekla.Structures.ModelInternal.dotEdges_t@)
Gets the edges of the custom part types geometry. These are in the custom parts own coordinate system,
since the geometry of the custom part type would be meaningless in locals.
name: The name of the custom part type.
edges: The edges of the custom part.
Returns: True if the edges were successfully retrieved, otherwise false.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportDMSetConnectedFaces(System.Int32,Tekla.Structures.DirectManipulation.Model.Native.dotDMObjectFaces_t@)
Sets the faces which are connected to the model object as the references.
objectId: The model object id.
objectFaces: The connected object faces.
Returns: True if the model object was successfully connected to the faces; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportDMGetConnectedFaces(System.Int32,Tekla.Structures.DirectManipulation.Model.Native.dotDMObjectFaces_t@)
Gets the faces which are connected to the model object as the references.
objectId: The model object id.
objectFaces: The connected object faces.
Returns: True if the connected faces were successfully retrieved; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportGetDMPlugin(Tekla.Structures.DirectManipulation.Adapter.State.Native.dotComponentData@)
Exports the get componentData data command.
componentData: The component data.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportDMGetPreviewSinglePolygonPolymesh(System.Int32,Tekla.Structures.DirectManipulation.Model.Native.dotDMPreviewPolygonFaceInput_t@,Tekla.Structures.ModelInternal.dotPolymesh_t@)
Exports the get preview polygon face command.
objectId: The ID of the model object lying under the picked point(s).
input: Input data consisting of planes defined as points and normals.
output: Output data as single polygon polymesh.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportDMGetActualSinglePolygonPolymesh(System.Int32,Tekla.Structures.DirectManipulation.Model.Native.dotDMPreviewPolygonFaceInput_t@,Tekla.Structures.ModelInternal.dotPolymesh_t@)
Exports the get actual polygon face command.
objectId: The ID of the model object lying under the picked point(s).
input: Input data consisting of planes defined as points and normals.
output: Output data as single polygon polymesh.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportDMGetPreviewPolylinePolymeshForCreation(System.Int32,Tekla.Structures.DirectManipulation.Model.Native.dotDMPreviewPolygonalPourBreakInput_t@,Tekla.Structures.ModelInternal.dotPolymesh_t@)
Exports the get preview polyline polymesh command for the creation of pour breaks.
objectId: The ID of the model object lying under the picked point(s).
input: Input data consisting of polyline points and extension direction.
output: Output data as polymesh consists of preview polygons.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportDMGetActualPolylinePolymeshForCreation(System.Int32,Tekla.Structures.ModelInternal.dotPolymesh_t@)
Exports the get actual polyline polymesh command for the creation of pour breaks.
objectId: The ID of the model object lying under the picked point(s).
polymesh: Input/output data as polymesh.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportDMGetPreviewPolylinePolymeshesForSplitting(System.Int32,Tekla.Structures.DirectManipulation.Model.Native.dotDMPreviewPolygonalPourBreakInput_t@,Tekla.Structures.ModelInternal.dotPolymesh_t@)
Exports the get command for preview polyline polymesh splitting of part.
objectId: The ID of the model object lying under the picked point(s).
input: Input data consisting of polyline points and extension direction.
output: Output data as polymesh consists of preview polygons.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportDMGetActualPolylinePolymeshesForSplitting(System.Int32,Tekla.Structures.ModelInternal.dotPolymesh_t@)
Exports the get command for actual polyline polymesh splitting of part.
objectId: The ID of the model object lying under the picked point(s).
polymesh: Input/output data as polymesh.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportDMGetPreviewPolylinePolymeshForModification(System.Int32,Tekla.Structures.DirectManipulation.Model.Native.dotDMPreviewPolygonalPourBreakInput_t@,Tekla.Structures.ModelInternal.dotPolymesh_t@)
Exports the get preview polyline polymesh command for the modification of pour breaks.
breakId: The ID of the model object lying under the picked point(s).
input: Input data consisting of polyline points and extension direction.
output: Output data as polymesh consists of preview polygons.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportDMGetActualPolylinePolymeshForModification(System.Int32,Tekla.Structures.ModelInternal.dotPolymesh_t@)
Exports the get actual polyline polymesh command for the modification of pour breaks.
breakId: The ID of the model object lying under the picked point(s).
polymesh: Input/output data as polymesh.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportIntListHandler(Tekla.Structures.ModelInternal.dotnetIntList_t@)
Exports the integer list handler.
pIntList: The integer list.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotImportIntListHandler(Tekla.Structures.ModelInternal.dotnetIntList_t@)
Imports the integer list handler.
pIntList: The integer list.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportDoubleListHandler(Tekla.Structures.ModelInternal.dotnetDoubleList_t@)
Exports the double list handler.
pDoubleList: The double list.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotImportDoubleListHandler(Tekla.Structures.ModelInternal.dotnetDoubleList_t@)
Imports the double list handler.
pDoubleList: The double list.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportPointListHandler(Tekla.Structures.ModelInternal.dotnetPointList_t@)
Exports the point list handler.
pPointList: The integer list.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotImportPointListHandler(Tekla.Structures.ModelInternal.dotnetPointList_t@)
Imports the point list handler.
pPointList: The integer list.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportRebarGuidelineCalculateSpacingActuals(Tekla.Structures.ModelInternal.dotRebarSpacing_t@,Tekla.Structures.ModelInternal.dotSpacingZone_t*,System.Double)
Calculates the guideline spacing 'actuals'.
dotSpacing: The spacing data.
pSpacingZones: The zones.
guidelineLength: The guideline length.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportRebarGuidelineGetActualCurve(System.Int32,System.Int32,System.Int32@,Tekla.Structures.DirectManipulation.Adapter.Native.dotBool@,Tekla.Structures.DirectManipulation.Adapter.Native.dotBool*@,Tekla.Structures.Internal.dotPoint_t*@)
Gets the guideline 'actual' curve.
id: The guideline ID.
rebarsetId: The rebarset ID.
pNumberPoint: The number of points.
followsEdges: An indication of whether the curve follows an edge.
pIsArcPoint: Whether the points are arc points.
pPoints: The points.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportRebarStripGetActualCurve(System.Int32,System.Int32@,Tekla.Structures.DirectManipulation.Adapter.Native.dotBool@,Tekla.Structures.DirectManipulation.Adapter.Native.dotBool*@,Tekla.Structures.Internal.dotPoint_t*@)
Gets the strip 'actual' curve.
stripId: The stripi ID.
pNumberPoint: The number of points.
followsEdges: An indication of whether the curve follows an edge.
pIsArcPoint: Whether the points are arc points.
pPoints: The points.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportRebarSetGetBarSurface(System.Int32,System.Int32,Tekla.Structures.DirectManipulation.Model.Native.dotBarSurface_t@)
Get the bar surface geometry for the given rebar set and bar ids.
rebarSetId: The rebar set id.
barId: The bar id.
barSurface: The bar surface.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportRebarSetGetAppliedAttributes(Tekla.Structures.ModelInternal.dotRebarSet_t@,Tekla.Structures.ModelInternal.dotGuideline_t@,Tekla.Structures.ModelInternal.dotLegFace_t@,Tekla.Structures.ModelInternal.dotSpacingZone_t*@)
The dot export rebar set get applied attributes method.
dotRebarSet: The dot rebar set.
dotGuideline: The dot guideline.
dotLegFace: The dot leg face.
ppSpacingZones: The zones.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportPropertyStripGetAppliedAttributes(Tekla.Structures.ModelInternal.dotRebarPropertyStrip_t@)
The dot export property strip get applied attributes method.
dotStrip: The dot strip.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportEndDetailStripGetAppliedAttributes(Tekla.Structures.ModelInternal.dotRebarEndDetailStrip_t@)
The dot export end detail strip get applied attributes method.
dotStrip: The dot strip.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportSplitterStripGetAppliedAttributes(Tekla.Structures.ModelInternal.dotRebarSplitter_t@)
The dot export splitter strip get applied attributes method.
dotStrip: The dot strip.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportRebarSetSetAppliedAttributes(Tekla.Structures.ModelInternal.dotRebarSet_t@,Tekla.Structures.ModelInternal.dotGuideline_t@,Tekla.Structures.ModelInternal.dotLegFace_t@,Tekla.Structures.ModelInternal.dotSpacingZone_t*)
The dot export rebar set set applied attributes method.
dotRebarSet: The dot rebar set.
dotGuideline: The dot guideline.
dotLegFace: The dot leg face.
pSpacingZones: The zones.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportPropertyStripSetAppliedAttributes(Tekla.Structures.ModelInternal.dotRebarPropertyStrip_t@)
The dot export property strip set applied attributes method.
dotStrip: The dot strip.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportEndDetailStripSetAppliedAttributes(Tekla.Structures.ModelInternal.dotRebarEndDetailStrip_t@)
The dot export end detail strip set applied attributes method.
dotStrip: The dot strip.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportSplitterStripSetAppliedAttributes(Tekla.Structures.ModelInternal.dotRebarSplitter_t@)
The dot export splitter strip set applied attributes method.
dotStrip: The dot strip.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportRebarSetLoadDialogAttributes(System.String,Tekla.Structures.ModelInternal.dotRebarSet_t@,Tekla.Structures.ModelInternal.dotGuideline_t@,Tekla.Structures.ModelInternal.dotLegFace_t@,Tekla.Structures.ModelInternal.dotSpacingZone_t*@)
The dot export rebar set load dialog attributes method.
filename: The filename.
dotRebarSet: The dot rebar set.
dotGuideline: The dot guideline.
dotLegFace: The dot leg face.
ppSpacingZones: The zones.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportPropertyStripLoadDialogAttributes(System.String,Tekla.Structures.ModelInternal.dotRebarPropertyStrip_t@)
The dot export property strip load dialog attributes method.
filename: The filename.
dotStrip: The dot strip.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportEndDetailStripLoadDialogAttributes(System.String,Tekla.Structures.ModelInternal.dotRebarEndDetailStrip_t@)
The dot export end detail strip load dialog attributes method.
filename: The filename.
dotStrip: The dot strip.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportSplitterStripLoadDialogAttributes(System.String,Tekla.Structures.ModelInternal.dotRebarSplitter_t@)
The dot export splitter strip load dialog attributes method.
filename: The filename.
dotStrip: The dot strip.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportRebarSetSaveDialogAttributes(System.String,Tekla.Structures.ModelInternal.dotRebarSet_t@,Tekla.Structures.ModelInternal.dotGuideline_t@,Tekla.Structures.ModelInternal.dotLegFace_t@,Tekla.Structures.ModelInternal.dotSpacingZone_t*)
The dot export rebar set save dialog attributes method.
filename: The filename.
dotRebarSet: The dot rebar set.
dotGuideline: The dot guideline.
dotLegFace: The dot leg face.
pSpacingZones: The zones.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportPropertyStripSaveDialogAttributes(System.String,Tekla.Structures.ModelInternal.dotRebarPropertyStrip_t@)
The dot export property strip save dialog attributes method.
filename: The filename.
dotStrip: The dot strip.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportEndDetailStripSaveDialogAttributes(System.String,Tekla.Structures.ModelInternal.dotRebarEndDetailStrip_t@)
The dot export end detail strip save dialog attributes method.
filename: The filename.
dotStrip: The dot strip.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportSplitterStripSaveDialogAttributes(System.String,Tekla.Structures.ModelInternal.dotRebarSplitter_t@)
The dot export splitter strip save dialog attributes method.
filename: The filename.
dotStrip: The dot strip.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportRebarSetDisplayUDAsDialog(System.Int32,System.Int32)
The dot export rebar set display UDAs dialog method.
id: The id.
type: The type.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportRebarSetGetAppliedUDAs(Tekla.Structures.ModelInternal.dotGetProperties_t@,System.Int32)
The dot export rebar set get applied UDAs method.
pProperties: The properties.
type: The type.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportRebarSetAutomaticGuidelineOffsets(System.Int32,System.Int32,System.Double@,System.Double@)
Calculates the spacing start/end offsets if those values are set to automatic.
rebarSetId: The rebar set id.
guidelineId: The guideline id.
startOffset: The calculated start offset.
endOffset: The calculated end offset.
Returns: True if successful, false otherwise.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotCheckForAndHandleNewCreatedDuplicates(System.Int32)
Checks whether given newly created object has duplicates in place.
If duplicate found, user prompt opens and asks user to keep, delete or cancel.
id: Object ID that is newly created.
Returns: True if user opted to delete the newly created duplicate object; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotChangeLegFaceLayer(System.Int32,System.Int32[],System.Int32,System.Int32)
Changes the legface layers.
rebarSetId: The owning rebarset.
legFaceIds: The ids of the faces to change.
count: The number of faces.
action: The action to perform.
Returns: True if successful.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotCreateRebarSetSurfaceObjectRelation(System.Int32,System.Int32)
Creates the rebar set/surface object relation.
rebarSetId: The rebar set ID.
surfaceObjectId: The surface object ID.
Returns: The new relation ID.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportUISelectObjects(Tekla.Structures.ModelInternal.dotUIModelObjectSelector_t@,Tekla.Structures.DirectManipulation.Adapter.Native.dotBool)
Select model objects in TS views.
pSelector: The selector argument.
useSubIds: A value indicating whether to use the object sub ids for selection.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportGetSurfacePreviewForCreation(System.Int32,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.ModelInternal.dotPolymesh_t@)
Gets the preview for the surface object.
id: The ID of the underlying model object.
pointOnFace: The point on the face of the underlying model object.
faceNormal: The normal of the face of the underlying model object.
output: Output data as surface preview.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportExtendWorkAreaOrViewDepth(System.Int32[],System.Int32)
Checks the work area and view depth based on the model object ids.
objectIds: The model object ids.
count: The number of object ids.
Returns: True if the work area or view depth should be expanded; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportFitWorkArea(System.Int32,System.Int32)
Fits the work area of the view with viewId.
viewId: The view ID.
onSelectedObjects: Whether the work area is fit based on the selected objects.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportCheckAutoSaveState
Checks the auto-save state (increase the command count and trigger auto-save if needed).
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportCleanShapeFromSolidCache(System.String)
Clean solid cache with given shape Guid
in order that cache can be updated with new shape geometry
shapeGuid: The shape GUID.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportCreateDMHandle(Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotBitmapHandle_t@)
Shows the bitmap associated to Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotBitmapHandle_t.BitmapIdentifier on Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotBitmapHandle_t.Location.
handle: The handle to show a bitmap on.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportCreateDmBitmap(System.Int32,Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotBitmap_t@)
Loads the bitmap of a handle on TS core side.
bitmapTargetType: The target type of the bitmap.
bitmap: The bitmap.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportSetDMHandleLocation(Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotBitmapHandle_t@)
Modifies the location of the bitmap associated to Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotBitmapHandle_t.BitmapIdentifier.
handle: The handle.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportDeleteDMHandle(Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotBitmapHandle_t@)
Removes the bitmap on Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotBitmapHandle_t.Location.
handle: The handle on which the bitmap is located.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportDMGetTemporaryGraphicsId(System.Int32@)
Exports the get temporary id command.
id: The identifier.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportDMRemoveTemporaryGraphics(System.Int32,System.Int32)
Exports the remove temporary graphics command.
id: The identifier.
subId: The sub-identifier.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportDMDrawTemporaryLines(Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotTemporaryDrawPolyLine_t@)
Exports the draw temporary polyline command.
pArgument: The argument.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportDMDrawTemporaryPolyLine(Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotTemporaryDrawPolyLine_t@)
Exports the draw temporary polyline command.
pArgument: The argument.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DotExportDMDrawTemporaryPolygonFace(Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotTemporaryDrawPolygonFace_t@)
Exports the draw temporary polygon face command.
pArgument: The argument.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Model.Native.NativeDllImport.DiaSetUpdateRebarSetAppliedUdaCallback(Tekla.Structures.DirectManipulation.Model.UpdateRebarSetAppliedUDAsDelegate)
Sets a callback for when the applied UDA values are changed for the RebarSet class.
p: The function to call when the values are changed.